Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/hemc.h
/*
 * Component description for HEMC
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-03-27T04:07:22Z */
#ifndef _SAMRH707_HEMC_COMPONENT_H_
#define _SAMRH707_HEMC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR HEMC                                         */
/* ************************************************************************** */

/* -------- HEMC_CR_NCS0 : (HEMC Offset: 0x00) (R/W 32) HEMC Control Register NCS 0 -------- */
#define HEMC_CR_NCS0_ZERO_Pos                 _UINT32_(0)                                          /* (HEMC_CR_NCS0) fixed to 0 Position */
#define HEMC_CR_NCS0_ZERO_Msk                 (_UINT32_(0x1) << HEMC_CR_NCS0_ZERO_Pos)             /* (HEMC_CR_NCS0) fixed to 0 Mask */
#define HEMC_CR_NCS0_ZERO(value)              (HEMC_CR_NCS0_ZERO_Msk & (_UINT32_(value) << HEMC_CR_NCS0_ZERO_Pos)) /* Assigment of value for ZERO in the HEMC_CR_NCS0 register */
#define HEMC_CR_NCS0_BANKSIZE_Pos             _UINT32_(1)                                          /* (HEMC_CR_NCS0) Bank Size Position */
#define HEMC_CR_NCS0_BANKSIZE_Msk             (_UINT32_(0x1F) << HEMC_CR_NCS0_BANKSIZE_Pos)        /* (HEMC_CR_NCS0) Bank Size Mask */
#define HEMC_CR_NCS0_BANKSIZE(value)          (HEMC_CR_NCS0_BANKSIZE_Msk & (_UINT32_(value) << HEMC_CR_NCS0_BANKSIZE_Pos)) /* Assigment of value for BANKSIZE in the HEMC_CR_NCS0 register */
#define   HEMC_CR_NCS0_BANKSIZE_8KB_Val       _UINT32_(0x0)                                        /* (HEMC_CR_NCS0) 8Kbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_16KB_Val      _UINT32_(0x1)                                        /* (HEMC_CR_NCS0) 16Kbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_32KB_Val      _UINT32_(0x2)                                        /* (HEMC_CR_NCS0) 32Kbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_64KB_Val      _UINT32_(0x3)                                        /* (HEMC_CR_NCS0) 64Kbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_128KB_Val     _UINT32_(0x4)                                        /* (HEMC_CR_NCS0) 128Kbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_256KB_Val     _UINT32_(0x5)                                        /* (HEMC_CR_NCS0) 256Kbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_512KB_Val     _UINT32_(0x6)                                        /* (HEMC_CR_NCS0) 512Kbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_1MB_Val       _UINT32_(0x7)                                        /* (HEMC_CR_NCS0) 1Mbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_2MB_Val       _UINT32_(0x8)                                        /* (HEMC_CR_NCS0) 2Mbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_NOT_USED_Val  _UINT32_(0x1F)                                       /* (HEMC_CR_NCS0) NOT_USED  */
#define HEMC_CR_NCS0_BANKSIZE_8KB             (HEMC_CR_NCS0_BANKSIZE_8KB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /* (HEMC_CR_NCS0) 8Kbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_16KB            (HEMC_CR_NCS0_BANKSIZE_16KB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /* (HEMC_CR_NCS0) 16Kbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_32KB            (HEMC_CR_NCS0_BANKSIZE_32KB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /* (HEMC_CR_NCS0) 32Kbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_64KB            (HEMC_CR_NCS0_BANKSIZE_64KB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /* (HEMC_CR_NCS0) 64Kbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_128KB           (HEMC_CR_NCS0_BANKSIZE_128KB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /* (HEMC_CR_NCS0) 128Kbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_256KB           (HEMC_CR_NCS0_BANKSIZE_256KB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /* (HEMC_CR_NCS0) 256Kbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_512KB           (HEMC_CR_NCS0_BANKSIZE_512KB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /* (HEMC_CR_NCS0) 512Kbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_1MB             (HEMC_CR_NCS0_BANKSIZE_1MB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /* (HEMC_CR_NCS0) 1Mbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_2MB             (HEMC_CR_NCS0_BANKSIZE_2MB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /* (HEMC_CR_NCS0) 2Mbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_NOT_USED        (HEMC_CR_NCS0_BANKSIZE_NOT_USED_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /* (HEMC_CR_NCS0) NOT_USED Position  */
#define HEMC_CR_NCS0_TYPE_Pos                 _UINT32_(6)                                          /* (HEMC_CR_NCS0) type of memory used Position */
#define HEMC_CR_NCS0_TYPE_Msk                 (_UINT32_(0x1) << HEMC_CR_NCS0_TYPE_Pos)             /* (HEMC_CR_NCS0) type of memory used Mask */
#define HEMC_CR_NCS0_TYPE(value)              (HEMC_CR_NCS0_TYPE_Msk & (_UINT32_(value) << HEMC_CR_NCS0_TYPE_Pos)) /* Assigment of value for TYPE in the HEMC_CR_NCS0 register */
#define HEMC_CR_NCS0_ADDBASE_Pos              _UINT32_(7)                                          /* (HEMC_CR_NCS0) relative base address of NCS area Position */
#define HEMC_CR_NCS0_ADDBASE_Msk              (_UINT32_(0x3FFFF) << HEMC_CR_NCS0_ADDBASE_Pos)      /* (HEMC_CR_NCS0) relative base address of NCS area Mask */
#define HEMC_CR_NCS0_ADDBASE(value)           (HEMC_CR_NCS0_ADDBASE_Msk & (_UINT32_(value) << HEMC_CR_NCS0_ADDBASE_Pos)) /* Assigment of value for ADDBASE in the HEMC_CR_NCS0 register */
#define HEMC_CR_NCS0_WRITE_ECC_CONF_Pos       _UINT32_(29)                                         /* (HEMC_CR_NCS0) ECC Configuration Protection Enable Position */
#define HEMC_CR_NCS0_WRITE_ECC_CONF_Msk       (_UINT32_(0x1) << HEMC_CR_NCS0_WRITE_ECC_CONF_Pos)   /* (HEMC_CR_NCS0) ECC Configuration Protection Enable Mask */
#define HEMC_CR_NCS0_WRITE_ECC_CONF(value)    (HEMC_CR_NCS0_WRITE_ECC_CONF_Msk & (_UINT32_(value) << HEMC_CR_NCS0_WRITE_ECC_CONF_Pos)) /* Assigment of value for WRITE_ECC_CONF in the HEMC_CR_NCS0 register */
#define HEMC_CR_NCS0_ECC_ENABLE_Pos           _UINT32_(30)                                         /* (HEMC_CR_NCS0) ECC Protection Enable Position */
#define HEMC_CR_NCS0_ECC_ENABLE_Msk           (_UINT32_(0x1) << HEMC_CR_NCS0_ECC_ENABLE_Pos)       /* (HEMC_CR_NCS0) ECC Protection Enable Mask */
#define HEMC_CR_NCS0_ECC_ENABLE(value)        (HEMC_CR_NCS0_ECC_ENABLE_Msk & (_UINT32_(value) << HEMC_CR_NCS0_ECC_ENABLE_Pos)) /* Assigment of value for ECC_ENABLE in the HEMC_CR_NCS0 register */
#define HEMC_CR_NCS0_Msk                      _UINT32_(0x61FFFFFF)                                 /* (HEMC_CR_NCS0) Register Mask  */


/* -------- HEMC_CR_NCS1 : (HEMC Offset: 0x04) (R/W 32) HEMC Control Register NCS 1 -------- */
#define HEMC_CR_NCS1_ZERO_Pos                 _UINT32_(0)                                          /* (HEMC_CR_NCS1) fixed to 0 Position */
#define HEMC_CR_NCS1_ZERO_Msk                 (_UINT32_(0x1) << HEMC_CR_NCS1_ZERO_Pos)             /* (HEMC_CR_NCS1) fixed to 0 Mask */
#define HEMC_CR_NCS1_ZERO(value)              (HEMC_CR_NCS1_ZERO_Msk & (_UINT32_(value) << HEMC_CR_NCS1_ZERO_Pos)) /* Assigment of value for ZERO in the HEMC_CR_NCS1 register */
#define HEMC_CR_NCS1_BANKSIZE_Pos             _UINT32_(1)                                          /* (HEMC_CR_NCS1) Bank Size Position */
#define HEMC_CR_NCS1_BANKSIZE_Msk             (_UINT32_(0x1F) << HEMC_CR_NCS1_BANKSIZE_Pos)        /* (HEMC_CR_NCS1) Bank Size Mask */
#define HEMC_CR_NCS1_BANKSIZE(value)          (HEMC_CR_NCS1_BANKSIZE_Msk & (_UINT32_(value) << HEMC_CR_NCS1_BANKSIZE_Pos)) /* Assigment of value for BANKSIZE in the HEMC_CR_NCS1 register */
#define   HEMC_CR_NCS1_BANKSIZE_8KB_Val       _UINT32_(0x0)                                        /* (HEMC_CR_NCS1) 8Kbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_16KB_Val      _UINT32_(0x1)                                        /* (HEMC_CR_NCS1) 16Kbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_32KB_Val      _UINT32_(0x2)                                        /* (HEMC_CR_NCS1) 32Kbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_64KB_Val      _UINT32_(0x3)                                        /* (HEMC_CR_NCS1) 64Kbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_128KB_Val     _UINT32_(0x4)                                        /* (HEMC_CR_NCS1) 128Kbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_256KB_Val     _UINT32_(0x5)                                        /* (HEMC_CR_NCS1) 256Kbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_512KB_Val     _UINT32_(0x6)                                        /* (HEMC_CR_NCS1) 512Kbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_1MB_Val       _UINT32_(0x7)                                        /* (HEMC_CR_NCS1) 1Mbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_2MB_Val       _UINT32_(0x8)                                        /* (HEMC_CR_NCS1) 2Mbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_NOT_USED_Val  _UINT32_(0x1F)                                       /* (HEMC_CR_NCS1) NOT_USED  */
#define HEMC_CR_NCS1_BANKSIZE_8KB             (HEMC_CR_NCS1_BANKSIZE_8KB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /* (HEMC_CR_NCS1) 8Kbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_16KB            (HEMC_CR_NCS1_BANKSIZE_16KB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /* (HEMC_CR_NCS1) 16Kbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_32KB            (HEMC_CR_NCS1_BANKSIZE_32KB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /* (HEMC_CR_NCS1) 32Kbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_64KB            (HEMC_CR_NCS1_BANKSIZE_64KB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /* (HEMC_CR_NCS1) 64Kbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_128KB           (HEMC_CR_NCS1_BANKSIZE_128KB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /* (HEMC_CR_NCS1) 128Kbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_256KB           (HEMC_CR_NCS1_BANKSIZE_256KB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /* (HEMC_CR_NCS1) 256Kbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_512KB           (HEMC_CR_NCS1_BANKSIZE_512KB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /* (HEMC_CR_NCS1) 512Kbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_1MB             (HEMC_CR_NCS1_BANKSIZE_1MB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /* (HEMC_CR_NCS1) 1Mbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_2MB             (HEMC_CR_NCS1_BANKSIZE_2MB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /* (HEMC_CR_NCS1) 2Mbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_NOT_USED        (HEMC_CR_NCS1_BANKSIZE_NOT_USED_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /* (HEMC_CR_NCS1) NOT_USED Position  */
#define HEMC_CR_NCS1_TYPE_Pos                 _UINT32_(6)                                          /* (HEMC_CR_NCS1) type of memory used Position */
#define HEMC_CR_NCS1_TYPE_Msk                 (_UINT32_(0x1) << HEMC_CR_NCS1_TYPE_Pos)             /* (HEMC_CR_NCS1) type of memory used Mask */
#define HEMC_CR_NCS1_TYPE(value)              (HEMC_CR_NCS1_TYPE_Msk & (_UINT32_(value) << HEMC_CR_NCS1_TYPE_Pos)) /* Assigment of value for TYPE in the HEMC_CR_NCS1 register */
#define HEMC_CR_NCS1_ADDBASE_Pos              _UINT32_(7)                                          /* (HEMC_CR_NCS1) relative base address of NCS area Position */
#define HEMC_CR_NCS1_ADDBASE_Msk              (_UINT32_(0x3FFFF) << HEMC_CR_NCS1_ADDBASE_Pos)      /* (HEMC_CR_NCS1) relative base address of NCS area Mask */
#define HEMC_CR_NCS1_ADDBASE(value)           (HEMC_CR_NCS1_ADDBASE_Msk & (_UINT32_(value) << HEMC_CR_NCS1_ADDBASE_Pos)) /* Assigment of value for ADDBASE in the HEMC_CR_NCS1 register */
#define HEMC_CR_NCS1_ECC_ENABLE_Pos           _UINT32_(30)                                         /* (HEMC_CR_NCS1) ECC Protection Enable Position */
#define HEMC_CR_NCS1_ECC_ENABLE_Msk           (_UINT32_(0x1) << HEMC_CR_NCS1_ECC_ENABLE_Pos)       /* (HEMC_CR_NCS1) ECC Protection Enable Mask */
#define HEMC_CR_NCS1_ECC_ENABLE(value)        (HEMC_CR_NCS1_ECC_ENABLE_Msk & (_UINT32_(value) << HEMC_CR_NCS1_ECC_ENABLE_Pos)) /* Assigment of value for ECC_ENABLE in the HEMC_CR_NCS1 register */
#define HEMC_CR_NCS1_Msk                      _UINT32_(0x41FFFFFF)                                 /* (HEMC_CR_NCS1) Register Mask  */


/* -------- HEMC_CTRL : (HEMC Offset: 0x18) (R/W 32) HEMC Polarity Control register -------- */
#define HEMC_CTRL_POL_Pos                     _UINT32_(0)                                          /* (HEMC_CTRL) External control buffer active polarity Position */
#define HEMC_CTRL_POL_Msk                     (_UINT32_(0x1) << HEMC_CTRL_POL_Pos)                 /* (HEMC_CTRL) External control buffer active polarity Mask */
#define HEMC_CTRL_POL(value)                  (HEMC_CTRL_POL_Msk & (_UINT32_(value) << HEMC_CTRL_POL_Pos)) /* Assigment of value for POL in the HEMC_CTRL register */
#define HEMC_CTRL_Msk                         _UINT32_(0x00000001)                                 /* (HEMC_CTRL) Register Mask  */


/* -------- HEMC_CRP_NCS : (HEMC Offset: 0x20) (R/W 32) HEMC Control Register Protection NCS -------- */
#define HEMC_CRP_NCS_MASTERNUMBER_Pos         _UINT32_(0)                                          /* (HEMC_CRP_NCS) Master Number ID Position */
#define HEMC_CRP_NCS_MASTERNUMBER_Msk         (_UINT32_(0xFFFF) << HEMC_CRP_NCS_MASTERNUMBER_Pos)  /* (HEMC_CRP_NCS) Master Number ID Mask */
#define HEMC_CRP_NCS_MASTERNUMBER(value)      (HEMC_CRP_NCS_MASTERNUMBER_Msk & (_UINT32_(value) << HEMC_CRP_NCS_MASTERNUMBER_Pos)) /* Assigment of value for MASTERNUMBER in the HEMC_CRP_NCS register */
#define HEMC_CRP_NCS_SUPERUSER_Pos            _UINT32_(16)                                         /* (HEMC_CRP_NCS) User or Superuser access Position */
#define HEMC_CRP_NCS_SUPERUSER_Msk            (_UINT32_(0x1) << HEMC_CRP_NCS_SUPERUSER_Pos)        /* (HEMC_CRP_NCS) User or Superuser access Mask */
#define HEMC_CRP_NCS_SUPERUSER(value)         (HEMC_CRP_NCS_SUPERUSER_Msk & (_UINT32_(value) << HEMC_CRP_NCS_SUPERUSER_Pos)) /* Assigment of value for SUPERUSER in the HEMC_CRP_NCS register */
#define HEMC_CRP_NCS_WR_Pos                   _UINT32_(17)                                         /* (HEMC_CRP_NCS) Write Access Position */
#define HEMC_CRP_NCS_WR_Msk                   (_UINT32_(0x1) << HEMC_CRP_NCS_WR_Pos)               /* (HEMC_CRP_NCS) Write Access Mask */
#define HEMC_CRP_NCS_WR(value)                (HEMC_CRP_NCS_WR_Msk & (_UINT32_(value) << HEMC_CRP_NCS_WR_Pos)) /* Assigment of value for WR in the HEMC_CRP_NCS register */
#define HEMC_CRP_NCS_RD_Pos                   _UINT32_(18)                                         /* (HEMC_CRP_NCS) Read Access Position */
#define HEMC_CRP_NCS_RD_Msk                   (_UINT32_(0x1) << HEMC_CRP_NCS_RD_Pos)               /* (HEMC_CRP_NCS) Read Access Mask */
#define HEMC_CRP_NCS_RD(value)                (HEMC_CRP_NCS_RD_Msk & (_UINT32_(value) << HEMC_CRP_NCS_RD_Pos)) /* Assigment of value for RD in the HEMC_CRP_NCS register */
#define HEMC_CRP_NCS_SPLITBANKSIZE_Pos        _UINT32_(19)                                         /* (HEMC_CRP_NCS) bank size internal separation Position */
#define HEMC_CRP_NCS_SPLITBANKSIZE_Msk        (_UINT32_(0x1F) << HEMC_CRP_NCS_SPLITBANKSIZE_Pos)   /* (HEMC_CRP_NCS) bank size internal separation Mask */
#define HEMC_CRP_NCS_SPLITBANKSIZE(value)     (HEMC_CRP_NCS_SPLITBANKSIZE_Msk & (_UINT32_(value) << HEMC_CRP_NCS_SPLITBANKSIZE_Pos)) /* Assigment of value for SPLITBANKSIZE in the HEMC_CRP_NCS register */
#define HEMC_CRP_NCS_PROTECTZONE_Pos          _UINT32_(24)                                         /* (HEMC_CRP_NCS) select area protected Position */
#define HEMC_CRP_NCS_PROTECTZONE_Msk          (_UINT32_(0x1) << HEMC_CRP_NCS_PROTECTZONE_Pos)      /* (HEMC_CRP_NCS) select area protected Mask */
#define HEMC_CRP_NCS_PROTECTZONE(value)       (HEMC_CRP_NCS_PROTECTZONE_Msk & (_UINT32_(value) << HEMC_CRP_NCS_PROTECTZONE_Pos)) /* Assigment of value for PROTECTZONE in the HEMC_CRP_NCS register */
#define HEMC_CRP_NCS_PROTECTON_Pos            _UINT32_(25)                                         /* (HEMC_CRP_NCS) protection activation Position */
#define HEMC_CRP_NCS_PROTECTON_Msk            (_UINT32_(0x1) << HEMC_CRP_NCS_PROTECTON_Pos)        /* (HEMC_CRP_NCS) protection activation Mask */
#define HEMC_CRP_NCS_PROTECTON(value)         (HEMC_CRP_NCS_PROTECTON_Msk & (_UINT32_(value) << HEMC_CRP_NCS_PROTECTON_Pos)) /* Assigment of value for PROTECTON in the HEMC_CRP_NCS register */
#define HEMC_CRP_NCS_Msk                      _UINT32_(0x03FFFFFF)                                 /* (HEMC_CRP_NCS) Register Mask  */


/* -------- HEMC_IER : (HEMC Offset: 0x38) ( /W 32) HEMC Interrupt Enable Register -------- */
#define HEMC_IER_OUTOFRANGE_Pos               _UINT32_(1)                                          /* (HEMC_IER) out of range Position */
#define HEMC_IER_OUTOFRANGE_Msk               (_UINT32_(0x1) << HEMC_IER_OUTOFRANGE_Pos)           /* (HEMC_IER) out of range Mask */
#define HEMC_IER_OUTOFRANGE(value)            (HEMC_IER_OUTOFRANGE_Msk & (_UINT32_(value) << HEMC_IER_OUTOFRANGE_Pos)) /* Assigment of value for OUTOFRANGE in the HEMC_IER register */
#define HEMC_IER_RDERRORACCESS_Pos            _UINT32_(2)                                          /* (HEMC_IER) read access error Position */
#define HEMC_IER_RDERRORACCESS_Msk            (_UINT32_(0x1) << HEMC_IER_RDERRORACCESS_Pos)        /* (HEMC_IER) read access error Mask */
#define HEMC_IER_RDERRORACCESS(value)         (HEMC_IER_RDERRORACCESS_Msk & (_UINT32_(value) << HEMC_IER_RDERRORACCESS_Pos)) /* Assigment of value for RDERRORACCESS in the HEMC_IER register */
#define HEMC_IER_WRERRORACCESS_Pos            _UINT32_(3)                                          /* (HEMC_IER) write access error Position */
#define HEMC_IER_WRERRORACCESS_Msk            (_UINT32_(0x1) << HEMC_IER_WRERRORACCESS_Pos)        /* (HEMC_IER) write access error Mask */
#define HEMC_IER_WRERRORACCESS(value)         (HEMC_IER_WRERRORACCESS_Msk & (_UINT32_(value) << HEMC_IER_WRERRORACCESS_Pos)) /* Assigment of value for WRERRORACCESS in the HEMC_IER register */
#define HEMC_IER_USERERRORACCESS_Pos          _UINT32_(4)                                          /* (HEMC_IER) user or superuser access error Position */
#define HEMC_IER_USERERRORACCESS_Msk          (_UINT32_(0x1) << HEMC_IER_USERERRORACCESS_Pos)      /* (HEMC_IER) user or superuser access error Mask */
#define HEMC_IER_USERERRORACCESS(value)       (HEMC_IER_USERERRORACCESS_Msk & (_UINT32_(value) << HEMC_IER_USERERRORACCESS_Pos)) /* Assigment of value for USERERRORACCESS in the HEMC_IER register */
#define HEMC_IER_Msk                          _UINT32_(0x0000001E)                                 /* (HEMC_IER) Register Mask  */


/* -------- HEMC_IDR : (HEMC Offset: 0x3C) ( /W 32) HEMC Interrupt Disable Register -------- */
#define HEMC_IDR_OUTOFRANGE_Pos               _UINT32_(1)                                          /* (HEMC_IDR) out of range Position */
#define HEMC_IDR_OUTOFRANGE_Msk               (_UINT32_(0x1) << HEMC_IDR_OUTOFRANGE_Pos)           /* (HEMC_IDR) out of range Mask */
#define HEMC_IDR_OUTOFRANGE(value)            (HEMC_IDR_OUTOFRANGE_Msk & (_UINT32_(value) << HEMC_IDR_OUTOFRANGE_Pos)) /* Assigment of value for OUTOFRANGE in the HEMC_IDR register */
#define HEMC_IDR_RDERRORACCESS_Pos            _UINT32_(2)                                          /* (HEMC_IDR) read access error Position */
#define HEMC_IDR_RDERRORACCESS_Msk            (_UINT32_(0x1) << HEMC_IDR_RDERRORACCESS_Pos)        /* (HEMC_IDR) read access error Mask */
#define HEMC_IDR_RDERRORACCESS(value)         (HEMC_IDR_RDERRORACCESS_Msk & (_UINT32_(value) << HEMC_IDR_RDERRORACCESS_Pos)) /* Assigment of value for RDERRORACCESS in the HEMC_IDR register */
#define HEMC_IDR_WRERRORACCESS_Pos            _UINT32_(3)                                          /* (HEMC_IDR) write access error Position */
#define HEMC_IDR_WRERRORACCESS_Msk            (_UINT32_(0x1) << HEMC_IDR_WRERRORACCESS_Pos)        /* (HEMC_IDR) write access error Mask */
#define HEMC_IDR_WRERRORACCESS(value)         (HEMC_IDR_WRERRORACCESS_Msk & (_UINT32_(value) << HEMC_IDR_WRERRORACCESS_Pos)) /* Assigment of value for WRERRORACCESS in the HEMC_IDR register */
#define HEMC_IDR_USERERRORACCESS_Pos          _UINT32_(4)                                          /* (HEMC_IDR) user or superuser access error Position */
#define HEMC_IDR_USERERRORACCESS_Msk          (_UINT32_(0x1) << HEMC_IDR_USERERRORACCESS_Pos)      /* (HEMC_IDR) user or superuser access error Mask */
#define HEMC_IDR_USERERRORACCESS(value)       (HEMC_IDR_USERERRORACCESS_Msk & (_UINT32_(value) << HEMC_IDR_USERERRORACCESS_Pos)) /* Assigment of value for USERERRORACCESS in the HEMC_IDR register */
#define HEMC_IDR_Msk                          _UINT32_(0x0000001E)                                 /* (HEMC_IDR) Register Mask  */


/* -------- HEMC_IMR : (HEMC Offset: 0x40) ( R/ 32) HEMC Interrupt Mask Register -------- */
#define HEMC_IMR_OUTOFRANGE_Pos               _UINT32_(1)                                          /* (HEMC_IMR) out of range Position */
#define HEMC_IMR_OUTOFRANGE_Msk               (_UINT32_(0x1) << HEMC_IMR_OUTOFRANGE_Pos)           /* (HEMC_IMR) out of range Mask */
#define HEMC_IMR_OUTOFRANGE(value)            (HEMC_IMR_OUTOFRANGE_Msk & (_UINT32_(value) << HEMC_IMR_OUTOFRANGE_Pos)) /* Assigment of value for OUTOFRANGE in the HEMC_IMR register */
#define HEMC_IMR_RDERRORACCESS_Pos            _UINT32_(2)                                          /* (HEMC_IMR) read access error Position */
#define HEMC_IMR_RDERRORACCESS_Msk            (_UINT32_(0x1) << HEMC_IMR_RDERRORACCESS_Pos)        /* (HEMC_IMR) read access error Mask */
#define HEMC_IMR_RDERRORACCESS(value)         (HEMC_IMR_RDERRORACCESS_Msk & (_UINT32_(value) << HEMC_IMR_RDERRORACCESS_Pos)) /* Assigment of value for RDERRORACCESS in the HEMC_IMR register */
#define HEMC_IMR_WRERRORACCESS_Pos            _UINT32_(3)                                          /* (HEMC_IMR) write access error Position */
#define HEMC_IMR_WRERRORACCESS_Msk            (_UINT32_(0x1) << HEMC_IMR_WRERRORACCESS_Pos)        /* (HEMC_IMR) write access error Mask */
#define HEMC_IMR_WRERRORACCESS(value)         (HEMC_IMR_WRERRORACCESS_Msk & (_UINT32_(value) << HEMC_IMR_WRERRORACCESS_Pos)) /* Assigment of value for WRERRORACCESS in the HEMC_IMR register */
#define HEMC_IMR_USERERRORACCESS_Pos          _UINT32_(4)                                          /* (HEMC_IMR) user or superuser access error Position */
#define HEMC_IMR_USERERRORACCESS_Msk          (_UINT32_(0x1) << HEMC_IMR_USERERRORACCESS_Pos)      /* (HEMC_IMR) user or superuser access error Mask */
#define HEMC_IMR_USERERRORACCESS(value)       (HEMC_IMR_USERERRORACCESS_Msk & (_UINT32_(value) << HEMC_IMR_USERERRORACCESS_Pos)) /* Assigment of value for USERERRORACCESS in the HEMC_IMR register */
#define HEMC_IMR_Msk                          _UINT32_(0x0000001E)                                 /* (HEMC_IMR) Register Mask  */


