Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/hemc.h
/* -------- HEMC_ISR : (HEMC Offset: 0x44) ( R/ 32) HEMC Interrupt Status Register -------- */
#define HEMC_ISR_OUTOFRANGE_Pos               _UINT32_(1)                                          /* (HEMC_ISR) out of range Position */
#define HEMC_ISR_OUTOFRANGE_Msk               (_UINT32_(0x1) << HEMC_ISR_OUTOFRANGE_Pos)           /* (HEMC_ISR) out of range Mask */
#define HEMC_ISR_OUTOFRANGE(value)            (HEMC_ISR_OUTOFRANGE_Msk & (_UINT32_(value) << HEMC_ISR_OUTOFRANGE_Pos)) /* Assigment of value for OUTOFRANGE in the HEMC_ISR register */
#define HEMC_ISR_RDERRORACCESS_Pos            _UINT32_(2)                                          /* (HEMC_ISR) read access error Position */
#define HEMC_ISR_RDERRORACCESS_Msk            (_UINT32_(0x1) << HEMC_ISR_RDERRORACCESS_Pos)        /* (HEMC_ISR) read access error Mask */
#define HEMC_ISR_RDERRORACCESS(value)         (HEMC_ISR_RDERRORACCESS_Msk & (_UINT32_(value) << HEMC_ISR_RDERRORACCESS_Pos)) /* Assigment of value for RDERRORACCESS in the HEMC_ISR register */
#define HEMC_ISR_WRERRORACCESS_Pos            _UINT32_(3)                                          /* (HEMC_ISR) Write access error Position */
#define HEMC_ISR_WRERRORACCESS_Msk            (_UINT32_(0x1) << HEMC_ISR_WRERRORACCESS_Pos)        /* (HEMC_ISR) Write access error Mask */
#define HEMC_ISR_WRERRORACCESS(value)         (HEMC_ISR_WRERRORACCESS_Msk & (_UINT32_(value) << HEMC_ISR_WRERRORACCESS_Pos)) /* Assigment of value for WRERRORACCESS in the HEMC_ISR register */
#define HEMC_ISR_USERERRORACCESS_Pos          _UINT32_(4)                                          /* (HEMC_ISR) User or SuperUser Error Access Position */
#define HEMC_ISR_USERERRORACCESS_Msk          (_UINT32_(0x1) << HEMC_ISR_USERERRORACCESS_Pos)      /* (HEMC_ISR) User or SuperUser Error Access Mask */
#define HEMC_ISR_USERERRORACCESS(value)       (HEMC_ISR_USERERRORACCESS_Msk & (_UINT32_(value) << HEMC_ISR_USERERRORACCESS_Pos)) /* Assigment of value for USERERRORACCESS in the HEMC_ISR register */
#define HEMC_ISR_Msk                          _UINT32_(0x0000001E)                                 /* (HEMC_ISR) Register Mask  */


/* -------- HEMC_SR : (HEMC Offset: 0x48) ( R/ 32) HEMC Status Register -------- */
#define HEMC_SR_OUTOFRANGE_Pos                _UINT32_(1)                                          /* (HEMC_SR) out of range Position */
#define HEMC_SR_OUTOFRANGE_Msk                (_UINT32_(0x1) << HEMC_SR_OUTOFRANGE_Pos)            /* (HEMC_SR) out of range Mask */
#define HEMC_SR_OUTOFRANGE(value)             (HEMC_SR_OUTOFRANGE_Msk & (_UINT32_(value) << HEMC_SR_OUTOFRANGE_Pos)) /* Assigment of value for OUTOFRANGE in the HEMC_SR register */
#define HEMC_SR_RDERRORACCESS_Pos             _UINT32_(2)                                          /* (HEMC_SR) Read access error Position */
#define HEMC_SR_RDERRORACCESS_Msk             (_UINT32_(0x1) << HEMC_SR_RDERRORACCESS_Pos)         /* (HEMC_SR) Read access error Mask */
#define HEMC_SR_RDERRORACCESS(value)          (HEMC_SR_RDERRORACCESS_Msk & (_UINT32_(value) << HEMC_SR_RDERRORACCESS_Pos)) /* Assigment of value for RDERRORACCESS in the HEMC_SR register */
#define HEMC_SR_WRERRORACCESS_Pos             _UINT32_(3)                                          /* (HEMC_SR) Write access error Position */
#define HEMC_SR_WRERRORACCESS_Msk             (_UINT32_(0x1) << HEMC_SR_WRERRORACCESS_Pos)         /* (HEMC_SR) Write access error Mask */
#define HEMC_SR_WRERRORACCESS(value)          (HEMC_SR_WRERRORACCESS_Msk & (_UINT32_(value) << HEMC_SR_WRERRORACCESS_Pos)) /* Assigment of value for WRERRORACCESS in the HEMC_SR register */
#define HEMC_SR_USERERRORACCESS_Pos           _UINT32_(4)                                          /* (HEMC_SR) User or SuperUser Error Access Position */
#define HEMC_SR_USERERRORACCESS_Msk           (_UINT32_(0x1) << HEMC_SR_USERERRORACCESS_Pos)       /* (HEMC_SR) User or SuperUser Error Access Mask */
#define HEMC_SR_USERERRORACCESS(value)        (HEMC_SR_USERERRORACCESS_Msk & (_UINT32_(value) << HEMC_SR_USERERRORACCESS_Pos)) /* Assigment of value for USERERRORACCESS in the HEMC_SR register */
#define HEMC_SR_Msk                           _UINT32_(0x0000001E)                                 /* (HEMC_SR) Register Mask  */


/* -------- HEMC_HECC_CR : (HEMC Offset: 0x100) (R/W 32) HECC Control Register Channel 0 (HSMC) -------- */
#define HEMC_HECC_CR_TEST_MODE_RD_Pos         _UINT32_(1)                                          /* (HEMC_HECC_CR) test mode of ECC protection - read mode Position */
#define HEMC_HECC_CR_TEST_MODE_RD_Msk         (_UINT32_(0x1) << HEMC_HECC_CR_TEST_MODE_RD_Pos)     /* (HEMC_HECC_CR) test mode of ECC protection - read mode Mask */
#define HEMC_HECC_CR_TEST_MODE_RD(value)      (HEMC_HECC_CR_TEST_MODE_RD_Msk & (_UINT32_(value) << HEMC_HECC_CR_TEST_MODE_RD_Pos)) /* Assigment of value for TEST_MODE_RD in the HEMC_HECC_CR register */
#define HEMC_HECC_CR_TEST_MODE_WR_Pos         _UINT32_(2)                                          /* (HEMC_HECC_CR) test mode of ECC protection - write mode Position */
#define HEMC_HECC_CR_TEST_MODE_WR_Msk         (_UINT32_(0x1) << HEMC_HECC_CR_TEST_MODE_WR_Pos)     /* (HEMC_HECC_CR) test mode of ECC protection - write mode Mask */
#define HEMC_HECC_CR_TEST_MODE_WR(value)      (HEMC_HECC_CR_TEST_MODE_WR_Msk & (_UINT32_(value) << HEMC_HECC_CR_TEST_MODE_WR_Pos)) /* Assigment of value for TEST_MODE_WR in the HEMC_HECC_CR register */
#define HEMC_HECC_CR_RST_FIX_CPT_Pos          _UINT32_(4)                                          /* (HEMC_HECC_CR) reset the fixable error counter Position */
#define HEMC_HECC_CR_RST_FIX_CPT_Msk          (_UINT32_(0x1) << HEMC_HECC_CR_RST_FIX_CPT_Pos)      /* (HEMC_HECC_CR) reset the fixable error counter Mask */
#define HEMC_HECC_CR_RST_FIX_CPT(value)       (HEMC_HECC_CR_RST_FIX_CPT_Msk & (_UINT32_(value) << HEMC_HECC_CR_RST_FIX_CPT_Pos)) /* Assigment of value for RST_FIX_CPT in the HEMC_HECC_CR register */
#define HEMC_HECC_CR_RST_NOFIX_CPT_Pos        _UINT32_(5)                                          /* (HEMC_HECC_CR) reset the un-fixable error counter Position */
#define HEMC_HECC_CR_RST_NOFIX_CPT_Msk        (_UINT32_(0x1) << HEMC_HECC_CR_RST_NOFIX_CPT_Pos)    /* (HEMC_HECC_CR) reset the un-fixable error counter Mask */
#define HEMC_HECC_CR_RST_NOFIX_CPT(value)     (HEMC_HECC_CR_RST_NOFIX_CPT_Msk & (_UINT32_(value) << HEMC_HECC_CR_RST_NOFIX_CPT_Pos)) /* Assigment of value for RST_NOFIX_CPT in the HEMC_HECC_CR register */
#define HEMC_HECC_CR_Msk                      _UINT32_(0x00000036)                                 /* (HEMC_HECC_CR) Register Mask  */


/* -------- HEMC_HECC_TESTCB : (HEMC Offset: 0x140) (R/W 32) HECC Test mode Register Channel 0 (HSMC) -------- */
#define HEMC_HECC_TESTCB_TCB1_Pos             _UINT32_(0)                                          /* (HEMC_HECC_TESTCB) test check bit (16 bit) Position */
#define HEMC_HECC_TESTCB_TCB1_Msk             (_UINT32_(0xFFFF) << HEMC_HECC_TESTCB_TCB1_Pos)      /* (HEMC_HECC_TESTCB) test check bit (16 bit) Mask */
#define HEMC_HECC_TESTCB_TCB1(value)          (HEMC_HECC_TESTCB_TCB1_Msk & (_UINT32_(value) << HEMC_HECC_TESTCB_TCB1_Pos)) /* Assigment of value for TCB1 in the HEMC_HECC_TESTCB register */
#define HEMC_HECC_TESTCB_Msk                  _UINT32_(0x0000FFFF)                                 /* (HEMC_HECC_TESTCB) Register Mask  */


/* -------- HEMC_HECC_SR : (HEMC Offset: 0x180) ( R/ 32) HECC Status Register -------- */
#define HEMC_HECC_SR_MEM_FIX_Pos              _UINT32_(0)                                          /* (HEMC_HECC_SR) Fixable error status Position */
#define HEMC_HECC_SR_MEM_FIX_Msk              (_UINT32_(0x1) << HEMC_HECC_SR_MEM_FIX_Pos)          /* (HEMC_HECC_SR) Fixable error status Mask */
#define HEMC_HECC_SR_MEM_FIX(value)           (HEMC_HECC_SR_MEM_FIX_Msk & (_UINT32_(value) << HEMC_HECC_SR_MEM_FIX_Pos)) /* Assigment of value for MEM_FIX in the HEMC_HECC_SR register */
#define HEMC_HECC_SR_CPT_FIX_Pos              _UINT32_(2)                                          /* (HEMC_HECC_SR) 5 bits counter Position */
#define HEMC_HECC_SR_CPT_FIX_Msk              (_UINT32_(0x1F) << HEMC_HECC_SR_CPT_FIX_Pos)         /* (HEMC_HECC_SR) 5 bits counter Mask */
#define HEMC_HECC_SR_CPT_FIX(value)           (HEMC_HECC_SR_CPT_FIX_Msk & (_UINT32_(value) << HEMC_HECC_SR_CPT_FIX_Pos)) /* Assigment of value for CPT_FIX in the HEMC_HECC_SR register */
#define HEMC_HECC_SR_OVER_FIX_Pos             _UINT32_(7)                                          /* (HEMC_HECC_SR) counter overflow Position */
#define HEMC_HECC_SR_OVER_FIX_Msk             (_UINT32_(0x1) << HEMC_HECC_SR_OVER_FIX_Pos)         /* (HEMC_HECC_SR) counter overflow Mask */
#define HEMC_HECC_SR_OVER_FIX(value)          (HEMC_HECC_SR_OVER_FIX_Msk & (_UINT32_(value) << HEMC_HECC_SR_OVER_FIX_Pos)) /* Assigment of value for OVER_FIX in the HEMC_HECC_SR register */
#define HEMC_HECC_SR_MEM_NOFIX_Pos            _UINT32_(8)                                          /* (HEMC_HECC_SR) Un-fixable error status Position */
#define HEMC_HECC_SR_MEM_NOFIX_Msk            (_UINT32_(0x1) << HEMC_HECC_SR_MEM_NOFIX_Pos)        /* (HEMC_HECC_SR) Un-fixable error status Mask */
#define HEMC_HECC_SR_MEM_NOFIX(value)         (HEMC_HECC_SR_MEM_NOFIX_Msk & (_UINT32_(value) << HEMC_HECC_SR_MEM_NOFIX_Pos)) /* Assigment of value for MEM_NOFIX in the HEMC_HECC_SR register */
#define HEMC_HECC_SR_CPT_NOFIX_Pos            _UINT32_(10)                                         /* (HEMC_HECC_SR) 5 bits counter Position */
#define HEMC_HECC_SR_CPT_NOFIX_Msk            (_UINT32_(0x1F) << HEMC_HECC_SR_CPT_NOFIX_Pos)       /* (HEMC_HECC_SR) 5 bits counter Mask */
#define HEMC_HECC_SR_CPT_NOFIX(value)         (HEMC_HECC_SR_CPT_NOFIX_Msk & (_UINT32_(value) << HEMC_HECC_SR_CPT_NOFIX_Pos)) /* Assigment of value for CPT_NOFIX in the HEMC_HECC_SR register */
#define HEMC_HECC_SR_OVER_NOFIX_Pos           _UINT32_(15)                                         /* (HEMC_HECC_SR) counter overflow Position */
#define HEMC_HECC_SR_OVER_NOFIX_Msk           (_UINT32_(0x1) << HEMC_HECC_SR_OVER_NOFIX_Pos)       /* (HEMC_HECC_SR) counter overflow Mask */
#define HEMC_HECC_SR_OVER_NOFIX(value)        (HEMC_HECC_SR_OVER_NOFIX_Msk & (_UINT32_(value) << HEMC_HECC_SR_OVER_NOFIX_Pos)) /* Assigment of value for OVER_NOFIX in the HEMC_HECC_SR register */
#define HEMC_HECC_SR_HES_Pos                  _UINT32_(24)                                         /* (HEMC_HECC_SR) Hardware Error Size Position */
#define HEMC_HECC_SR_HES_Msk                  (_UINT32_(0x7) << HEMC_HECC_SR_HES_Pos)              /* (HEMC_HECC_SR) Hardware Error Size Mask */
#define HEMC_HECC_SR_HES(value)               (HEMC_HECC_SR_HES_Msk & (_UINT32_(value) << HEMC_HECC_SR_HES_Pos)) /* Assigment of value for HES in the HEMC_HECC_SR register */
#define HEMC_HECC_SR_TYPE_Pos                 _UINT32_(27)                                         /* (HEMC_HECC_SR) write or read access Position */
#define HEMC_HECC_SR_TYPE_Msk                 (_UINT32_(0x1) << HEMC_HECC_SR_TYPE_Pos)             /* (HEMC_HECC_SR) write or read access Mask */
#define HEMC_HECC_SR_TYPE(value)              (HEMC_HECC_SR_TYPE_Msk & (_UINT32_(value) << HEMC_HECC_SR_TYPE_Pos)) /* Assigment of value for TYPE in the HEMC_HECC_SR register */
#define HEMC_HECC_SR_Msk                      _UINT32_(0x0F00FDFD)                                 /* (HEMC_HECC_SR) Register Mask  */


/* -------- HEMC_HECC_IER : (HEMC Offset: 0x184) ( /W 32) HECC Interrupt Enable Register -------- */
#define HEMC_HECC_IER_MEM_FIX_Pos             _UINT32_(0)                                          /* (HEMC_HECC_IER) Fixable error Position */
#define HEMC_HECC_IER_MEM_FIX_Msk             (_UINT32_(0x1) << HEMC_HECC_IER_MEM_FIX_Pos)         /* (HEMC_HECC_IER) Fixable error Mask */
#define HEMC_HECC_IER_MEM_FIX(value)          (HEMC_HECC_IER_MEM_FIX_Msk & (_UINT32_(value) << HEMC_HECC_IER_MEM_FIX_Pos)) /* Assigment of value for MEM_FIX in the HEMC_HECC_IER register */
#define HEMC_HECC_IER_MEM_NOFIX_Pos           _UINT32_(1)                                          /* (HEMC_HECC_IER) Un-fixable error Position */
#define HEMC_HECC_IER_MEM_NOFIX_Msk           (_UINT32_(0x1) << HEMC_HECC_IER_MEM_NOFIX_Pos)       /* (HEMC_HECC_IER) Un-fixable error Mask */
#define HEMC_HECC_IER_MEM_NOFIX(value)        (HEMC_HECC_IER_MEM_NOFIX_Msk & (_UINT32_(value) << HEMC_HECC_IER_MEM_NOFIX_Pos)) /* Assigment of value for MEM_NOFIX in the HEMC_HECC_IER register */
#define HEMC_HECC_IER_Msk                     _UINT32_(0x00000003)                                 /* (HEMC_HECC_IER) Register Mask  */


