Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/hemc.h
/* -------- HEMC_HECC_IDR : (HEMC Offset: 0x188) ( /W 32) HECC Interrupt Disable Register -------- */
#define HEMC_HECC_IDR_MEM_FIX_Pos             _UINT32_(0)                                          /* (HEMC_HECC_IDR) fixable error Position */
#define HEMC_HECC_IDR_MEM_FIX_Msk             (_UINT32_(0x1) << HEMC_HECC_IDR_MEM_FIX_Pos)         /* (HEMC_HECC_IDR) fixable error Mask */
#define HEMC_HECC_IDR_MEM_FIX(value)          (HEMC_HECC_IDR_MEM_FIX_Msk & (_UINT32_(value) << HEMC_HECC_IDR_MEM_FIX_Pos)) /* Assigment of value for MEM_FIX in the HEMC_HECC_IDR register */
#define HEMC_HECC_IDR_MEM_NOFIX_Pos           _UINT32_(1)                                          /* (HEMC_HECC_IDR) un-fixable error Position */
#define HEMC_HECC_IDR_MEM_NOFIX_Msk           (_UINT32_(0x1) << HEMC_HECC_IDR_MEM_NOFIX_Pos)       /* (HEMC_HECC_IDR) un-fixable error Mask */
#define HEMC_HECC_IDR_MEM_NOFIX(value)        (HEMC_HECC_IDR_MEM_NOFIX_Msk & (_UINT32_(value) << HEMC_HECC_IDR_MEM_NOFIX_Pos)) /* Assigment of value for MEM_NOFIX in the HEMC_HECC_IDR register */
#define HEMC_HECC_IDR_Msk                     _UINT32_(0x00000003)                                 /* (HEMC_HECC_IDR) Register Mask  */


/* -------- HEMC_HECC_IMR : (HEMC Offset: 0x18C) ( R/ 32) HECC Interrupt Mask Register -------- */
#define HEMC_HECC_IMR_MEM_FIX_Pos             _UINT32_(0)                                          /* (HEMC_HECC_IMR) fixable error Position */
#define HEMC_HECC_IMR_MEM_FIX_Msk             (_UINT32_(0x1) << HEMC_HECC_IMR_MEM_FIX_Pos)         /* (HEMC_HECC_IMR) fixable error Mask */
#define HEMC_HECC_IMR_MEM_FIX(value)          (HEMC_HECC_IMR_MEM_FIX_Msk & (_UINT32_(value) << HEMC_HECC_IMR_MEM_FIX_Pos)) /* Assigment of value for MEM_FIX in the HEMC_HECC_IMR register */
#define HEMC_HECC_IMR_MEM_NOFIX_Pos           _UINT32_(1)                                          /* (HEMC_HECC_IMR) un-fixable error Position */
#define HEMC_HECC_IMR_MEM_NOFIX_Msk           (_UINT32_(0x1) << HEMC_HECC_IMR_MEM_NOFIX_Pos)       /* (HEMC_HECC_IMR) un-fixable error Mask */
#define HEMC_HECC_IMR_MEM_NOFIX(value)        (HEMC_HECC_IMR_MEM_NOFIX_Msk & (_UINT32_(value) << HEMC_HECC_IMR_MEM_NOFIX_Pos)) /* Assigment of value for MEM_NOFIX in the HEMC_HECC_IMR register */
#define HEMC_HECC_IMR_Msk                     _UINT32_(0x00000003)                                 /* (HEMC_HECC_IMR) Register Mask  */


/* -------- HEMC_HECC_FAILAR : (HEMC Offset: 0x190) ( R/ 32) HECC Fail address register -------- */
#define HEMC_HECC_FAILAR_ADDRESS_Pos          _UINT32_(0)                                          /* (HEMC_HECC_FAILAR) address of the error detected Position */
#define HEMC_HECC_FAILAR_ADDRESS_Msk          (_UINT32_(0xFFFFFFFF) << HEMC_HECC_FAILAR_ADDRESS_Pos) /* (HEMC_HECC_FAILAR) address of the error detected Mask */
#define HEMC_HECC_FAILAR_ADDRESS(value)       (HEMC_HECC_FAILAR_ADDRESS_Msk & (_UINT32_(value) << HEMC_HECC_FAILAR_ADDRESS_Pos)) /* Assigment of value for ADDRESS in the HEMC_HECC_FAILAR register */
#define HEMC_HECC_FAILAR_Msk                  _UINT32_(0xFFFFFFFF)                                 /* (HEMC_HECC_FAILAR) Register Mask  */


/* -------- HEMC_HECC_FAILDR : (HEMC Offset: 0x194) ( R/ 32) HECC Fail data register -------- */
#define HEMC_HECC_FAILDR_DATA_Pos             _UINT32_(0)                                          /* (HEMC_HECC_FAILDR) Data error detected Position */
#define HEMC_HECC_FAILDR_DATA_Msk             (_UINT32_(0xFFFFFFFF) << HEMC_HECC_FAILDR_DATA_Pos)  /* (HEMC_HECC_FAILDR) Data error detected Mask */
#define HEMC_HECC_FAILDR_DATA(value)          (HEMC_HECC_FAILDR_DATA_Msk & (_UINT32_(value) << HEMC_HECC_FAILDR_DATA_Pos)) /* Assigment of value for DATA in the HEMC_HECC_FAILDR register */
#define HEMC_HECC_FAILDR_Msk                  _UINT32_(0xFFFFFFFF)                                 /* (HEMC_HECC_FAILDR) Register Mask  */


/** \brief HEMC register offsets definitions */
#define HEMC_CR_NCS0_REG_OFST          _UINT32_(0x00)      /* (HEMC_CR_NCS0) HEMC Control Register NCS 0 Offset */
#define HEMC_CR_NCS1_REG_OFST          _UINT32_(0x04)      /* (HEMC_CR_NCS1) HEMC Control Register NCS 1 Offset */
#define HEMC_CTRL_REG_OFST             _UINT32_(0x18)      /* (HEMC_CTRL) HEMC Polarity Control register Offset */
#define HEMC_CRP_NCS_REG_OFST          _UINT32_(0x20)      /* (HEMC_CRP_NCS) HEMC Control Register Protection NCS Offset */
#define HEMC_CRP_NCS0_REG_OFST         _UINT32_(0x20)      /* (HEMC_CRP_NCS0) HEMC Control Register Protection NCS Offset */
#define HEMC_CRP_NCS1_REG_OFST         _UINT32_(0x24)      /* (HEMC_CRP_NCS1) HEMC Control Register Protection NCS Offset */
#define HEMC_IER_REG_OFST              _UINT32_(0x38)      /* (HEMC_IER) HEMC Interrupt Enable Register Offset */
#define HEMC_IDR_REG_OFST              _UINT32_(0x3C)      /* (HEMC_IDR) HEMC Interrupt Disable Register Offset */
#define HEMC_IMR_REG_OFST              _UINT32_(0x40)      /* (HEMC_IMR) HEMC Interrupt Mask Register Offset */
#define HEMC_ISR_REG_OFST              _UINT32_(0x44)      /* (HEMC_ISR) HEMC Interrupt Status Register Offset */
#define HEMC_SR_REG_OFST               _UINT32_(0x48)      /* (HEMC_SR) HEMC Status Register Offset */
#define HEMC_HECC_CR_REG_OFST          _UINT32_(0x100)     /* (HEMC_HECC_CR) HECC Control Register Channel 0 (HSMC) Offset */
#define HEMC_HECC_TESTCB_REG_OFST      _UINT32_(0x140)     /* (HEMC_HECC_TESTCB) HECC Test mode Register Channel 0 (HSMC) Offset */
#define HEMC_HECC_SR_REG_OFST          _UINT32_(0x180)     /* (HEMC_HECC_SR) HECC Status Register Offset */
#define HEMC_HECC_IER_REG_OFST         _UINT32_(0x184)     /* (HEMC_HECC_IER) HECC Interrupt Enable Register Offset */
#define HEMC_HECC_IDR_REG_OFST         _UINT32_(0x188)     /* (HEMC_HECC_IDR) HECC Interrupt Disable Register Offset */
#define HEMC_HECC_IMR_REG_OFST         _UINT32_(0x18C)     /* (HEMC_HECC_IMR) HECC Interrupt Mask Register Offset */
#define HEMC_HECC_FAILAR_REG_OFST      _UINT32_(0x190)     /* (HEMC_HECC_FAILAR) HECC Fail address register Offset */
#define HEMC_HECC_FAILDR_REG_OFST      _UINT32_(0x194)     /* (HEMC_HECC_FAILDR) HECC Fail data register Offset */

