Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/hemc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief HEMC register API structure */
typedef struct
{
  __IO  uint32_t                       HEMC_CR_NCS0;       /**< Offset: 0x00 (R/W  32) HEMC Control Register NCS 0 */
  __IO  uint32_t                       HEMC_CR_NCS1;       /**< Offset: 0x04 (R/W  32) HEMC Control Register NCS 1 */
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       HEMC_CTRL;          /**< Offset: 0x18 (R/W  32) HEMC Polarity Control register */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       HEMC_CRP_NCS[2];    /**< Offset: 0x20 (R/W  32) HEMC Control Register Protection NCS */
  __I   uint8_t                        Reserved3[0x10];
  __O   uint32_t                       HEMC_IER;           /**< Offset: 0x38 ( /W  32) HEMC Interrupt Enable Register */
  __O   uint32_t                       HEMC_IDR;           /**< Offset: 0x3C ( /W  32) HEMC Interrupt Disable Register */
  __I   uint32_t                       HEMC_IMR;           /**< Offset: 0x40 (R/   32) HEMC Interrupt Mask Register */
  __I   uint32_t                       HEMC_ISR;           /**< Offset: 0x44 (R/   32) HEMC Interrupt Status Register */
  __I   uint32_t                       HEMC_SR;            /**< Offset: 0x48 (R/   32) HEMC Status Register */
  __I   uint8_t                        Reserved4[0xB4];
  __IO  uint32_t                       HEMC_HECC_CR;       /**< Offset: 0x100 (R/W  32) HECC Control Register Channel 0 (HSMC) */
  __I   uint8_t                        Reserved5[0x3C];
  __IO  uint32_t                       HEMC_HECC_TESTCB;   /**< Offset: 0x140 (R/W  32) HECC Test mode Register Channel 0 (HSMC) */
  __I   uint8_t                        Reserved6[0x3C];
  __I   uint32_t                       HEMC_HECC_SR;       /**< Offset: 0x180 (R/   32) HECC Status Register */
  __O   uint32_t                       HEMC_HECC_IER;      /**< Offset: 0x184 ( /W  32) HECC Interrupt Enable Register */
  __O   uint32_t                       HEMC_HECC_IDR;      /**< Offset: 0x188 ( /W  32) HECC Interrupt Disable Register */
  __I   uint32_t                       HEMC_HECC_IMR;      /**< Offset: 0x18C (R/   32) HECC Interrupt Mask Register */
  __I   uint32_t                       HEMC_HECC_FAILAR;   /**< Offset: 0x190 (R/   32) HECC Fail address register */
  __I   uint32_t                       HEMC_HECC_FAILDR;   /**< Offset: 0x194 (R/   32) HECC Fail data register */
} hemc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMRH707_HEMC_COMPONENT_H_ */
